app/Controllers/Admin.php

    public function index()
    {
        $course = $this->courseModel->getCourse();

        // simpan data ke var.
        $data = [
            'course' => $this->courseModel->paginate(8, 'course'),
            'pager' => $this->courseModel->pager,
        ];
---
SELECT *
FROM `course`
 LIMIT 8, 8
SELECT COUNT(*) AS `numrows`
FROM `course`