app/Controllers/Course.php

    public function index()
    {
        // cari data
        $course = $this->courseModel->getCourse();
        $session = session();
        $userNow = $session->get('id');

        $user = $this->userModel->getUser($userNow);

        // simpan data ke var.
        $data = [
            'course' => $this->courseModel->paginate(6, 'course'),
            'pager' => $this->courseModel->pager,
            'user' => $user,
        ];
---
SELECT *
FROM `course`
 LIMIT 6, 6