app/Controllers/Home.php

SELECT *
FROM `course`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `course`
---
    public function index()
    {
        // cari data
        $course = $this->courseModel->getCourse();

        $session = session();
        $userNow = $session->get('id');

        $user = $this->userModel->getUser($userNow);

        // dd($userNow);

        // simpan data ke var.
        $data = [
            'course' => $this->courseModel->paginate(8),
            'pager' => $this->courseModel->pager,
            'user' => $user,
        ];