app/Models/courseModel.php

    public function getCourse($id_course = false)
    {
        if ($id_course == false) {
            return $this->findAll();
        }

        return $this->where(['id_course' => $id_course])->first();
---
SELECT *
FROM `course`
SELECT *
FROM `course`
WHERE `id_course` = '20'
 LIMIT 1