app/Models/enrollmentModel.php

    function getEnroll(){
        return $this->db->table('enrollment')
        ->join('user', 'user.id_user = enrollment.id_user')
        ->join('course', 'course.id_course = enrollment.id_course')
        ->get()->getResultArray();
---
SELECT *
FROM `enrollment`
JOIN `user` ON `user`.`id_user` = `enrollment`.`id_user`
JOIN `course` ON `course`.`id_course` = `enrollment`.`id_course`
WHERE `enrollment`.`id_course` = '20'