app/Models/userModel.php

SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `id_user` = '1'
 LIMIT 1
---
    public function getUser($id_user = false)
    {
        if ($id_user == false) {
            return $this->findAll();
        }

        return $this->where(['id_user' => $id_user])->first();

SELECT *
FROM `user`
WHERE `email` = 'yosafatcrypter@gmail.com'
 LIMIT 1
---
    public function getUserLogin($email)
    {
        return $this->where(['email' => $email])->first();